Danielmzeng/esp32KeyVault/test_app/sdkconfig.defaults
# Target must match the main app (net_usb/tinyusb is esp32s3-only).
CONFIG_IDF_TARGET="esp32s3"

# Required by vault_cert: runtime X.509 self-signed certificate creation.
# MBEDTLS_X509_CREATE_C defaults to 'n' in ESP-IDF v6; it pulls in
# MBEDTLS_X509_CRT_WRITE_C (the mbedtls_x509write_crt_* API). PK_WRITE_C and
# PEM_WRITE_C default to 'y' already.
CONFIG_MBEDTLS_X509_CREATE_C=y

# Required by net_usb: TinyUSB NCM network class.
CONFIG_TINYUSB_NET_MODE_NCM=y

# Required by vault_api: TLS server + HTTPS server support.
CONFIG_ESP_TLS_SERVER=y
CONFIG_ESP_HTTPS_SERVER_ENABLE=y

# Enable C++ exceptions for the C++ port (and doctest, which needs them).
CONFIG_COMPILER_CXX_EXCEPTIONS=y
